[{"question_id": "Spring_2020_1", "topic": "Linear Programming", "question_description": "Consider the following linear program:\n\nmax c^T x\n\nsubject to Ax < b\n\nwhere A is an m x n matrix of real numbers, x is an n-dimensional vector, and b and c are n-dimensional vectors. Write down the dual of this linear program.", "answer": "The dual of the linear program is:\n\nmin b^T y\n\nsubject to A^T y > c\n\nwhere y is an m-dimensional vector.", "hint": "Remember that the dual of a linear program is obtained by exchanging the roles of the objective function and the constraints.", "subproblem": [{"title": "Write down the objective function of the dual linear program.", "description": "The objective function of the dual linear program is min b^T y, where y is an m-dimensional vector."}, {"title": "Write down the constraints of the dual linear program.", "description": "The constraints of the dual linear program are A^T y > c, where c is an n-dimensional vector."}], "simplifiedAns": "In the given linear program, we are trying to maximize a linear objective function (c^T x) subject to a set of linear constraints (Ax < b). The variables in this problem are the vector x, which has n dimensions.\n\nThe dual of a linear program is a way to find the lower bound on the optimal value of the original problem. In this case, the dual problem is to minimize a linear objective function (b^T y) subject to a set of linear constraints (A^T y > c). The variables in the dual problem are the vector y, which has m dimensions.\n\nTo understand the solution in the context of the problem, let's consider an analogy. Imagine you are a student trying to maximize your grades in different subjects, represented by the vector x. The grades are subject to certain constraints, such as the maximum number of hours you can study (represented by the matrix A) and the minimum grades you need to maintain (represented by the vector b).\n\nNow, let's say there is a teacher who wants to minimize the effort they put into grading your papers, represented by the vector y. The effort is subject to certain constraints, such as the maximum number of papers they can grade (represented by the matrix A^T) and the minimum quality of the papers they expect (represented by the vector c).\n\nThe solution to the dual problem, finding the minimum effort for the teacher, provides insights into the lower bound on the optimal value of your grades. It helps us understand the trade-off between the constraints and the objective function in the original problem.\n\nIn summary, the dual problem provides a different perspective on the original linear program, allowing us to understand the lower bound on the optimal value. It helps us analyze the relationship between the constraints and the objective function in a concise and easy-to-understand manner, using the analogy of a student trying to maximize grades and a teacher trying to minimize effort."}, {"question_id": "Spring_2020_2", "topic": "Linear Programming", "question_description": "Fill in the blank to complete the proof for weak duality and briefly justify.\n\nPrimal: max c^T x\n\nsubject to Ax < b\n\nDual: min b^T y\n\nsubject to A^T y > c\n\nProof: c^T x <= y^T (Ax) <= y^T b", "answer": "c^T x <= y^T (Ax) <= y^T b", "hint": "Remember that the dual problem is the same as the primal problem but with the constraints and objective function flipped.", "subproblem": [{"title": "Prove c^T x <= y^T (Ax)", "description": "Start by expanding the left side of the inequality. Then, use the definition of the dual problem to substitute the right side of the inequality."}, {"title": "Prove y^T (Ax) <= y^T b", "description": "Start by expanding the left side of the inequality. Then, use the definition of the dual problem to substitute the right side of the inequality."}], "simplifiedAns": "To prove weak duality, we start with the primal problem, which aims to maximize the objective function c^T x, subject to the constraint Ax < b. \n\nNow, let's consider the dual problem, which aims to minimize the objective function b^T y, subject to the constraint A^T y > c. \n\nIn the proof, we want to show that the optimal solution of the primal problem, denoted as c^T x, is always less than or equal to the optimal solution of the dual problem, denoted as y^T b. \n\nTo do this, we first observe that y^T (Ax) represents the inner product of the dual variable y and the primal constraint Ax. Since the primal constraint is Ax < b, we can conclude that y^T (Ax) <= y^T b. This is because the dual variable y is subject to the constraint A^T y > c, which implies that y^T (Ax) <= y^T b. \n\nTherefore, we have c^T x <= y^T (Ax) <= y^T b, which shows that the optimal solution of the primal problem is always less than or equal to the optimal solution of the dual problem. This is known as weak duality. \n\nTo understand this concept, let's consider an analogy. Imagine you are trying to maximize your profit by selling different products. The primal problem represents your objective of maximizing profit, while the dual problem represents the objective of minimizing the cost of production. Weak duality states that your maximum profit will always be less than or equal to the minimum cost of production. In other words, you cannot make more profit than the cost of producing the products."}, {"question_id": "Spring_2020_3", "topic": "Linear Programming", "question_description": "Consider a linear program with the following constraints:\n\nmax c^T x\n\nsubject to Ax <= b\n\nwhere A is an m x n matrix, x is an n-dimensional vector, and b and c are n-dimensional vectors. Write down the dual of this linear program.", "answer": "The dual of the linear program is:\n\nmin b^T y\n\nsubject to A^T y >= c\n\nwhere y is an m-dimensional vector.", "hint": "Remember that the dual of a linear program is obtained by exchanging the roles of the objective function and the constraints.", "subproblem": [{"title": "Write down the objective function of the dual linear program.", "description": "The objective function of the dual linear program is min b^T y, where y is an m-dimensional vector."}, {"title": "Write down the constraints of the dual linear program.", "description": "The constraints of the dual linear program are A^T y >= c, where c is an n-dimensional vector."}], "simplifiedAns": "In the given linear program, we are trying to maximize a linear objective function (c^T x) subject to a set of linear constraints (Ax <= b). The variables in this problem are the vector x, which has n dimensions.\n\nThe dual of a linear program is a way to find the lower bound on the optimal value of the original problem. It involves minimizing a different objective function (b^T y) subject to a different set of constraints (A^T y >= c). The variables in the dual problem are the vector y, which has m dimensions.\n\nTo understand the solution in the context of the problem, let's consider an analogy. Imagine you are a chef trying to maximize the taste of a dish while staying within certain constraints. The original problem is like you trying to find the best combination of ingredients (x) to maximize the taste (c^T x) while ensuring that the dish doesn't exceed certain limits (Ax <= b).\n\nNow, let's say there is a food critic who wants to find the minimum cost of the dish (b^T y) while ensuring that the taste (c^T x) is not compromised. The critic's problem is the dual problem, where they are trying to find the best combination of critiques (y) to minimize the cost (b^T y) while ensuring that the taste (c^T x) is not compromised.\n\nThe solution to the dual problem provides us with a lower bound on the optimal value of the original problem. In other words, it tells us the minimum cost (b^T y) that can be achieved while still satisfying the taste constraints (Ax <= b).\n\nBy solving the dual problem, we can gain insights into the trade-offs between the taste and cost of the dish. It helps us understand the relationship between the constraints and the objective function in a different perspective.\n\nOverall, the dual problem provides a valuable tool for analyzing and optimizing linear programs, allowing us to explore different aspects of the problem and make informed decisions."}]